-- phpMyAdmin SQL Dump
-- version 5.2.1
-- https://www.phpmyadmin.net/
--
-- Host: 127.0.0.1
-- Generation Time: Aug 15, 2025 at 05:13 AM
-- Server version: 10.4.28-MariaDB
-- PHP Version: 8.2.4

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `msu`
--
CREATE DATABASE IF NOT EXISTS `msu` DEFAULT CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci;
USE `msu`;

-- --------------------------------------------------------

--
-- Table structure for table `faculty`
--

CREATE TABLE `faculty` (
  `f_id` int(4) NOT NULL,
  `f_name` varchar(200) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `faculty`
--

INSERT INTO `faculty` (`f_id`, `f_name`) VALUES
(1, 'คณะการบัญชีและการจัดการ'),
(2, 'คณะวิทยาศาสตร์'),
(3, 'คณะแพทยศาสตร์'),
(4, 'คณะศึกษาศาสตร์'),
(5, 'คณะเทคโนโลยี'),
(6, 'คณะสิ่งแวดล้อม');

-- --------------------------------------------------------

--
-- Table structure for table `students`
--

CREATE TABLE `students` (
  `s_id` varchar(11) NOT NULL,
  `s_name` varchar(200) NOT NULL,
  `s_address` text NOT NULL,
  `s_gpax` float(3,2) NOT NULL,
  `f_id` int(4) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `students`
--

INSERT INTO `students` (`s_id`, `s_name`, `s_address`, `s_gpax`, `f_id`) VALUES
('64010912537', 'นายปิยะพงษ์ ศุภเสถียร', 'เลย', 3.44, 2),
('65010912505', 'นางสาวชนิษฎา เทียงแสน', 'ขอนแก่น', 2.91, 2),
('65010912509', 'นายณภัทร พิมพรัตน์', 'กรุงเทพมหานคร', 2.31, 4),
('65010914613', 'นายอริยพงศ์ อริยอัครพงษ์', 'กรุงเทพมหานคร', 2.87, 4),
('65010916012', 'นางสาวรมิดา กนกฆะนะรัชย์', 'จังหวัดขอนแก่น', 3.96, 2),
('65010916028', 'นางสาวนงลักษณ์ เคลื่อนไธสงค์', 'จังหวัดเลย', 3.97, 4),
('65010916034', 'นางสาวอัชญาญา ปิตะแสง', 'จังหวัดสกลนคร', 3.98, 2),
('6501091605', 'นางสาวศศิธร พินิรัมย์', 'จังหวัดบุรีรัมย์', 3.99, 3),
('66010916003', 'นายนธภูมิ เเจ่มจำรูญ', 'มหาสารคาม', 2.03, 3),
('66010916004', 'นางสาวพรหล้า ป้องคำ', 'กรุงเทพมหานคร', 3.39, 1),
('66010916009', 'นางสาวพรเพชร สุขล้ำคณา', 'ขอนแก่น', 2.59, 3),
('66010916012', 'นายกิตติพงษ์ นาคคันธร', 'กาฬสินธุ์', 3.59, 4),
('66010916014', 'นางสาวจุฑามาศ สายอภัย', 'กรุงเทพมหานคร', 3.81, 2),
('66010916015', 'นายนลธวัช พิมหาญทวีทรัพย์', 'มหาสารคาม', 3.54, 2),
('66010916016', 'นางสาวนิติกาล โสสุด', 'มหาสารคาม', 3.11, 4),
('66010916017', 'นางสาวมนต์พิม ถมทอง', 'ร้อยเอ็ด', 2.43, 3),
('66010916018', 'นางสาวมนัสนันท์ เมืองจันทร์', 'ขอนแก่น', 3.47, 4),
('66010916019', 'นางสาวรมิดา กนกฆะนะรัชต์', 'ร้อยเอ็ด', 2.66, 3),
('66010916021', 'นางสาวสงกรานต์ หนูน้อย', 'กาฬสินธุ์', 2.75, 1),
('66010916022', 'นายสรรเพชร โสดาวัตร', 'ขอนแก่น', 2.29, 2),
('66010916025', 'นายคมกริช ค้าเกิด', 'มหาสารคาม', 2.91, 2),
('66010916026', 'นางสาวทิพย์สุดา วงค์อินพ่อ', 'กาฬสินธุ์', 3.94, 2),
('66010916027', 'นายธีร์จุฑา จัตุรัส', 'กรุงเทพมหานคร', 3.44, 2),
('66010916028', 'นางสาวนงลักษณ์ เคลื่อนไธสงค์', 'ขอนแก่น', 2.56, 4),
('66010916034', 'นางสาวอัชนัญญา ปิตะแสง', 'ขอนแก่น', 3.85, 3),
('66010916036', 'นางสาวณัฐติกานต์ ศรีพลรส', 'มหาสารคาม', 3.69, 3),
('66010916037', 'นางสาวตรีชฎา บัณฑิต', 'ร้อยเอ็ด', 2.72, 3),
('66010916038', 'นายธนพล พรหมมา', 'อุดรธานี', 2.40, 4),
('66010916040', 'นางสาวปณิดา ม่วงเจริญ', 'มหาสารคาม', 3.56, 1),
('66010916042', 'นางสาวแพรวา ริโยธา', 'ร้อยเอ็ด', 2.75, 1),
('66010916047', 'นายวรกฤต พ่อหลอน', 'ร้อยเอ็ด', 2.06, 2),
('66010916050', 'นางสาวจารวี เชียงใต้', 'กาฬสินธุ์', 3.40, 1),
('66010916051', 'นางสาวณฐนนท หิรัณยานนท์', 'ร้อยเอ็ด', 3.42, 1),
('66010916052', 'นางสาวธิญาพร รักอยู่ประเสริฐ', 'กาฬสินธุ์', 2.66, 4),
('66010916053', 'นางสาวนันทิชา อุสาใจ', 'ขอนแก่น', 2.83, 2),
('66010916054', 'นางสาวปัณณธร เวฬุวันใน', 'อุดรธานี', 3.87, 4),
('66010916057', 'นางสาวศศิธร พินิรัมย์', 'มหาสารคาม', 3.47, 4),
('66010916063', 'นายกณวรรธน์ คำหารพล', 'อุดรธานี', 3.87, 4),
('66010916066', 'นางสาวฑิฆัมพร จำรัสศรี', 'กาฬสินธุ์', 2.03, 2),
('66010916068', 'นางสาวณัฐสุภา โยธากุล', 'สุรินทร์', 3.15, 3),
('66010916069', 'นายธนาธิป พนานุสรณ์', 'ขอนแก่น', 2.26, 3),
('66010916073', 'นายพงศกร พิสิษฐ์ปวีณ์ลภัส', 'มหาสารคาม', 2.23, 2),
('66010916075', 'นางสาวมณีรัตน์ แน่นอุดร', 'ร้อยเอ็ด', 2.63, 3),
('66010916076', 'นายวสวัตติ์ เสาวรส', 'กรุงเทพมหานคร', 3.08, 2),
('66010916077', 'นางสาวสุนิตา ทรารมย์', 'กาฬสินธุ์', 3.26, 2),
('66010916079', 'นางสาวอภิญญา ประสม', 'สุรินทร์', 2.07, 3),
('66010916082', 'นายกิจนันท์ สังข์สี', 'ขอนแก่น', 3.09, 1),
('66010916084', 'นายคุณากร จันทร์เงิน', 'มุกดาหาร', 3.19, 2),
('6640106079', 'นางสาวอภิญญา ประสม', 'จังหวัดพิษณุโลก', 3.95, 1);

--
-- Indexes for dumped tables
--

--
-- Indexes for table `faculty`
--
ALTER TABLE `faculty`
  ADD PRIMARY KEY (`f_id`);

--
-- Indexes for table `students`
--
ALTER TABLE `students`
  ADD PRIMARY KEY (`s_id`);

--
-- AUTO_INCREMENT for dumped tables
--

--
-- AUTO_INCREMENT for table `faculty`
--
ALTER TABLE `faculty`
  MODIFY `f_id` int(4) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=10;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
